Revit 2027 API
ParameterTypeId.AnalyticalModelWallAlignmentMethod Property
 "Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelWallAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelWallAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelWallAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelWallAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace